{"data": [{"title": "Who makes the key decisions at Ethereum?", "text": "For example, who are the people who decide whether to proceed to Ethereum 2.0,  proof of stake, or decide Ethereum's inflation rate?\n\nIs it just a small group of people, or is there some voting mechanism that allows Eth holders to vote?", "comments": [], "created": 1610292637.0}, {"title": "Long time hodlr looking to become more active, could use advice", "text": "I'm looking for resources and possibly programs that will help me become a knowledgeable trader.  The past few weeks I feel like I'm spending hours on YouTube running in circles and coming out with little,  I'm looking for something with structure. Would appreciate some advice", "comments": [{"body": "For most people your time would be better spent earning more Fiat to buy more ETH. High chance of getting REKT whilst attempting to day trade, and fees will eat up most of your profits. \n\nSo my advice to you would be continue to HODL, and earn more cash to DCA your position more often.", "created": 1610292033.0}], "created": 1610291876.0}, {"title": "I bought ETH on the wrong exchange", "text": "I just boutht ETH on Bitstamp, without realizing that their ETH withdrawal fee is much higher than that of BTC (0.05 against 0.0005).\n\nWhat can I do in order to get the coins into a hardware wallet without paying such a high fee?", "comments": [], "created": 1610291653.0}, {"title": "Tracing Ethereum transactions", "text": "It's not a secret that Ethereum blockchain is consistent and transparent for observation. From a side of trust this is wonderful, but what if you don't want to be identified while enjoy Ethereum opportunities? \r\n\r\nBitcoin blockchain is already became almost not anonymous due to such organizations as [AMLBot](https://t.me/cryptoaml_bot) and [Crystal](https://crystalblockchain.com). The approach to identify abstract user is simple:\r\n\r\n1. Find interested wallet\r\n2. Trace it till known exchange\r\n3. Request owner's personal data \r\n\r\nI have to say, that this is not such hard: known Blockchain tracers provide automated solutions to find the whole way of cryptocurrency from anonyms wallets to known entities (exchanges, custodial wallets etc.) and having some juridical power (e.g. intelligence services have) allow to request owner's personal data in just a week, whoop.. abstract wallet had became a concrete person.\r\n\r\nCrystal is already implementing tracing for Litecoin and Ethereum blockchains. Also, I want to admit [WhaleTrace](https://whaletrace.com) which is tracing and sending notifications about transactions in hundreds of blockchains following user determined parameters.\r\n\r\n**Don't you dare to think that Ethereum will become an open-book with actually no anonymity guarantees?**\r\n\r\nEven cross-blockchain swaps through [REN Protocol](https://renproject.io) won't drop tails if wrap, say, Bitcoin into Ethereum (wBTC) and reverse: do comply time and value between incoming transaction in blockchain A and outcoming transacation in blockchain B to continue tracing in another blockchain.\r\n\r\n**The solution:** r/BuccaneerV2 smart-contract on Ethereum. It have been developed in the middle 2020 and the core feature is that all transactions within the application goes hidden from Etherscan, while they actually written in Ethereum blockchain and share all its benefits such as decentralization and trustless. Every new transaction delete information about previous ones and constantly increase difficulty of identification.\r\n\r\nLiterally, no information about transactions, check it [here](https://etherscan.io/address/0xd5a7d515fb8b3337acb9b053743e0bc18f50c855) *all the transactions are interactions with transparent [Uniswap: BUCC Liquidity Pool](https://uniswap.info/pair/0x7772612549F27Aa49c83Fa59ab726f4799E4ecDc), but no BUCC transfers itself, no holders, no value... but they exist.\r\n\r\nMake your own judgement and choose wisely.", "comments": [], "created": 1610291429.0}, {"title": "ETH to the moon", "text": "New ATH by end of January?", "comments": [{"body": "🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "created": 1610293480.0}], "created": 1610291286.0}, {"title": "Conservative Estimate (1 Eth = $4,000 at least), Detailed Market Cap Calculation", "text": "TLDR: 1 Ethereum is worth at least $4,000, corresponding to 457 Billion market cap.\n\nBased on very conservative estimate of 1% adoption/usage by tech or finance sectors.\n\n\\-----------------\n\nUS Tech Sector --- 9 Trillion\n\nEurope Tech Sector --- 8.9 trillion\n\nChina Tech Sector --- At Least 1.3 Trillion \n\nFinance Sector --- 26.5 Trillion\n\n\\------------\n\nTotal: 45.7 Trillion\n\nNote that we have not considered other parts of Asia, Australia, Africa, nor other sectors like accountancy.\n\nIf Ethereum becomes just 1% of the tech/finance sector, that would be 0.457 Trillion = 457 Billion.\n\nToday's price of $1292 corresponds to market cap of 144 Billion.\n\n457 billion / 144 billion = 3.17 \n\n3.17 times of $1292 = $4000 (rounded).\n\n&#x200B;\n\nSources:\n\nUS Tech market cap:\n\n[https://www.forbes.com/sites/sergeiklebnikov/2020/08/28/us-tech-stocks-are-now-worth-more-than-9-trillion-eclipsing-the-entire-european-stock-market/?sh=2f141c523e61](https://www.forbes.com/sites/sergeiklebnikov/2020/08/28/us-tech-stocks-are-now-worth-more-than-9-trillion-eclipsing-the-entire-european-stock-market/?sh=2f141c523e61)\n\nFinance Market Cap:\n\n[https://www.prnewswire.com/news-releases/financial-services-market-value-is-expected-to-reach-26521-67-billion-by-2022--300982560.html](https://www.prnewswire.com/news-releases/financial-services-market-value-is-expected-to-reach-26521-67-billion-by-2022--300982560.html)\n\nChina Tech Market Cap: \n\n[https://www.btimesonline.com/articles/127387/20200226/chinese-tech-firms-chinese-software-companies-top-5-china-software-companies.htm](https://www.btimesonline.com/articles/127387/20200226/chinese-tech-firms-chinese-software-companies-top-5-china-software-companies.htm)", "comments": [{"body": "Adoption is not market cap.  Market cap is the supply times the last traded price.\n\nFor stocks, the price (in theory) should be the net present value of all future earnings, with a higher discount rate for less certainty.\n\nEthereum can't really be valued this way, because it's not a security (if you want to debate that, you at least must concede it's not only a security).  It's virtual oil, virtual real estate, a currency, and many other things.\n\nI believe ETH will go up because we haven't even scratched the surface of it's possibilities or its potential users, and because there are going to be major improvements to the network in the next 5 years.  I think the current adopters are largely under 40, and they will continue to accumulate as they grow their personal wealth through day jobs and inheritance.  I think bear cycles will get less severe as the market grows.\n\nHowever I can't possibly forecast a future market cap because it is unlike any other asset ever seen.  A 2025 price of somewhere between $1k and $100k seems like a reasonable bet.", "created": 1610287474.0}], "created": 1610281674.0}, {"title": "Thinking about swapping some donuts for some ETH", "text": "Should I do it on Uniswap, is there anyp ossible risk when doing this?", "comments": [{"body": "There is no risk on uniswap", "created": 1610280936.0}, {"body": "Just don't cheap out on gas when using Uniswap.  Your transaction can fail if the terms of your trade change too much while your transaction is pending.  The Metamask suggested Normal amount has always been sufficient for me.", "created": 1610288176.0}], "created": 1610279486.0}, {"title": "Bitcoin was not the first", "text": "(Please note this is speculation and not a case to buy or sell)\n\nBitcoin has seen massive growth due to institutions buying, a hedge against inflation, money making opportunity etc.\n\nA quick summary as you will. Its essentially been treated as a safe haven.\n\nHistorically Safe havens don't last very long and  institutions are more of a mix between profit maximisers and hodlers of various assets.\n\nIn the 70s gold and silver saw impressive rallies due to runaway inflation. These rallies were fueled mostly by institutions and big players. However the prices of assets crashed soon after.\n\nSince the USA government managed to get a hold of things by raising intrest rates to 20%. \n\n2011 saw another impressive gold and silver rally due to  US hesitation to raise the debt ceiling. Usually raising the debt ceiling happens automatically and quickly. There was a real possibility that the USA wouldn't be able to pay its debts.\n\nOnce the US raised the debt ceiling safe havens such as Gold and Silver tanked.\n\nWho remembers ww3? When Trump assassinated Soleimani?\n\nPanic ensued and people thought a USA-Iran war would lead to a world war though other global powers siding with Iran.\n\nDuring this this time Bitcoin had a impressive rally, however cooler heads managed to prevail and the crisis was averted.\n\nWould have bitcoin continued rise without covid 19? unlikely due to assets such as oil dropped after ww3 was averted.\n\nFinally we have Covid 19 where bitcoin crashed with the rest of the financial markets. The crash was so great there weren't any buy orders on exchange order books.\n\nIronically Bitcoin and other financial markets were saved by the federal reserve. The very thing the crypto community despises. If they didn't print money this rally would be impossible.\n\nI can confidently say we would see a multi year bear market in every financial asset, if money wasn't printed.\n\nIf Bitcoin was a safe haven why did it tank?\n\nMoving forward today, the global governments are in crisis, however I doubt it will last long because we have had major crisises before and things have recovered just fine.\n\nIf bitcoin is a safe haven, I think it will tank if and when things go back to normal. Just like any other safe haven in history.\n\nAnyhow everyone in the crypto community should be thanking and kissing the feet of the federal reserve. If it weren't for the money printer the market rallies would have been impossible.", "comments": [], "created": 1610292444.0}, {"title": "Bitcoin in its early years...", "text": "Who else remembers when Bitcoin was very new? I remember going on the dark web out of curiosity and almost every onion site sold product for Bitcoin. I thought it was just a scam because no one else was taking it as payment... only illegal products were sold for Bitcoin. Obviously if there was anything legit you could buy with it I would have bought some. The Dark Web was the only place I have ever heard of crypto until it’s boom. \n\nWhen did you first hear about Bitcoin and what kept you skeptical? Or did you believe in it from the beginning?", "comments": [{"body": "I believed it from the start, I just had no money to buy it with", "created": 1610290966.0}], "created": 1610290337.0}, {"title": "Is ZRX a good investment at 50 coins for $25?", "text": "I'm new to crypto trading, and want to buy some lower end coins to get into stable trading and looking to understand what to look for when trading\n\nAny advice, different investment ideas or anything would be great :)", "comments": [], "created": 1610287221.0}, {"title": "I've been hodling small bits for years, I want to understand trading, looking for where to start.", "text": "I want to take my little bit of knowledge to the next level,  I want to be able to look at graphs and understand them, be able to build a strategy and eventually day trade. So far I end up watching YouTube in an unorganized manner for hours and I come out with nothing.  I would really appreciate some direction.", "comments": [{"body": "There are some good trading courses out there. But also a lot of rubbish ones. Find people who have successfully supplemented some or all of their income and talk to them about how they learned the ropes.", "created": 1610270602.0}, {"body": "Get onto [binance ](https://seobetter.com/binance) and trade there. They have tutorials on different strategies you can follow.", "created": 1610281358.0}], "created": 1610268386.0}, {"title": "Buying some XHV. You can burn this shit to mint private stable coins without intermediaries", "text": "It uses Monero tech for privacy and ChainLink as an oracle. They'll integrate more oracles in the future.\n\nAltseason vibe has me like a child in a candy store 🍦🍪🍭🍬🥞", "comments": [], "created": 1610265972.0}]}